; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-3-23)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city2)
	(fuel-level plane1 fl0)
	(at plane2 city6)
	(fuel-level plane2 fl2)
	(at plane3 city3)
	(fuel-level plane3 fl0)
	(at person1 city4)
	(at person2 city0)
	(at person3 city1)
	(at person4 city0)
	(at person5 city3)
	(at person6 city2)
	(at person7 city4)
	(at person8 city6)
	(at person9 city2)
	(at person10 city1)
	(at person11 city5)
	(at person12 city1)
	(at person13 city5)
	(at person14 city2)
	(at person15 city0)
	(at person16 city2)
	(at person17 city4)
	(at person18 city2)
	(at person19 city5)
	(at person20 city4)
	(at person21 city4)
	(at person22 city4)
	(at person23 city0)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city5)
	(at person1 city0)
	(at person2 city3)
	(at person3 city3)
	(at person4 city2)
	(at person5 city3)
	(at person6 city1)
	(at person7 city2)
	(at person8 city0)
	(at person9 city4)
	(at person10 city1)
	(at person11 city5)
	(at person12 city5)
	(at person13 city6)
	(at person14 city0)
	(at person15 city3)
	(at person17 city3)
	(at person18 city3)
	(at person20 city0)
	(at person21 city6)
	(at person22 city0)
	(at person23 city5)
	))

)

; plan
1. (fly plane2 city6 city0 fl2 fl1)
   deleted: (at plane2 city6) (fuel-level plane2 fl2)
   added: (at plane2 city0) (fuel-level plane2 fl1)
   goals met: 3 of 22
2. (board person4 plane2 city0)
   deleted: (at person4 city0)
   added: (in person4 plane2)
   goals met: 3 of 22
3. (board person23 plane2 city0)
   deleted: (at person23 city0)
   added: (in person23 plane2)
   goals met: 3 of 22
4. (board person2 plane2 city0)
   deleted: (at person2 city0)
   added: (in person2 plane2)
   goals met: 3 of 22
5. (board person15 plane2 city0)
   deleted: (at person15 city0)
   added: (in person15 plane2)
   goals met: 3 of 22
6. (refuel plane1 city2 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 3 of 22
7. (board person9 plane1 city2)
   deleted: (at person9 city2)
   added: (in person9 plane1)
   goals met: 3 of 22
8. (board person6 plane1 city2)
   deleted: (at person6 city2)
   added: (in person6 plane1)
   goals met: 3 of 22
9. (board person18 plane1 city2)
   deleted: (at person18 city2)
   added: (in person18 plane1)
   goals met: 3 of 22
10. (board person14 plane1 city2)
   deleted: (at person14 city2)
   added: (in person14 plane1)
   goals met: 3 of 22
11. (fly plane2 city0 city3 fl1 fl0)
   deleted: (at plane2 city0) (fuel-level plane2 fl1)
   added: (at plane2 city3) (fuel-level plane2 fl0)
   goals met: 3 of 22
12. (refuel plane2 city3 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 3 of 22
13. (debark person2 plane2 city3)
   deleted: (in person2 plane2)
   added: (at person2 city3)
   goals met: 4 of 22
14. (debark person15 plane2 city3)
   deleted: (in person15 plane2)
   added: (at person15 city3)
   goals met: 5 of 22
15. (fly plane2 city3 city2 fl1 fl0)
   deleted: (at plane2 city3) (fuel-level plane2 fl1)
   added: (at plane2 city2) (fuel-level plane2 fl0)
   goals met: 5 of 22
16. (refuel plane2 city2 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 5 of 22
17. (debark person4 plane2 city2)
   deleted: (in person4 plane2)
   added: (at person4 city2)
   goals met: 6 of 22
18. (fly plane2 city2 city5 fl1 fl0)
   deleted: (at plane2 city2) (fuel-level plane2 fl1)
   added: (at plane2 city5) (fuel-level plane2 fl0)
   goals met: 6 of 22
19. (debark person23 plane2 city5)
   deleted: (in person23 plane2)
   added: (at person23 city5)
   goals met: 7 of 22
20. (board person13 plane2 city5)
   deleted: (at person13 city5)
   added: (in person13 plane2)
   goals met: 7 of 22
21. (refuel plane2 city5 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 7 of 22
22. (fly plane2 city5 city6 fl1 fl0)
   deleted: (at plane2 city5) (fuel-level plane2 fl1)
   added: (at plane2 city6) (fuel-level plane2 fl0)
   goals met: 7 of 22
23. (board person8 plane2 city6)
   deleted: (at person8 city6)
   added: (in person8 plane2)
   goals met: 7 of 22
24. (refuel plane2 city6 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 7 of 22
25. (debark person13 plane2 city6)
   deleted: (in person13 plane2)
   added: (at person13 city6)
   goals met: 8 of 22
26. (fly plane1 city2 city0 fl1 fl0)
   deleted: (at plane1 city2) (fuel-level plane1 fl1)
   added: (at plane1 city0) (fuel-level plane1 fl0)
   goals met: 8 of 22
27. (refuel plane1 city0 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 8 of 22
28. (debark person14 plane1 city0)
   deleted: (in person14 plane1)
   added: (at person14 city0)
   goals met: 9 of 22
29. (fly plane1 city0 city1 fl1 fl0)
   deleted: (at plane1 city0) (fuel-level plane1 fl1)
   added: (at plane1 city1) (fuel-level plane1 fl0)
   goals met: 9 of 22
30. (refuel plane1 city1 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 9 of 22
31. (fly plane2 city6 city0 fl1 fl0)
   deleted: (at plane2 city6) (fuel-level plane2 fl1)
   added: (at plane2 city0) (fuel-level plane2 fl0)
   goals met: 9 of 22
32. (debark person8 plane2 city0)
   deleted: (in person8 plane2)
   added: (at person8 city0)
   goals met: 10 of 22
33. (debark person6 plane1 city1)
   deleted: (in person6 plane1)
   added: (at person6 city1)
   goals met: 11 of 22
34. (board person3 plane1 city1)
   deleted: (at person3 city1)
   added: (in person3 plane1)
   goals met: 11 of 22
35. (board person12 plane1 city1)
   deleted: (at person12 city1)
   added: (in person12 plane1)
   goals met: 11 of 22
36. (fly plane1 city1 city4 fl1 fl0)
   deleted: (at plane1 city1) (fuel-level plane1 fl1)
   added: (at plane1 city4) (fuel-level plane1 fl0)
   goals met: 11 of 22
37. (refuel plane1 city4 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 11 of 22
38. (debark person9 plane1 city4)
   deleted: (in person9 plane1)
   added: (at person9 city4)
   goals met: 12 of 22
39. (board person7 plane1 city4)
   deleted: (at person7 city4)
   added: (in person7 plane1)
   goals met: 12 of 22
40. (board person22 plane1 city4)
   deleted: (at person22 city4)
   added: (in person22 plane1)
   goals met: 12 of 22
41. (board person21 plane1 city4)
   deleted: (at person21 city4)
   added: (in person21 plane1)
   goals met: 12 of 22
42. (board person20 plane1 city4)
   deleted: (at person20 city4)
   added: (in person20 plane1)
   goals met: 12 of 22
43. (board person17 plane1 city4)
   deleted: (at person17 city4)
   added: (in person17 plane1)
   goals met: 12 of 22
44. (board person1 plane1 city4)
   deleted: (at person1 city4)
   added: (in person1 plane1)
   goals met: 12 of 22
45. (fly plane1 city4 city0 fl1 fl0)
   deleted: (at plane1 city4) (fuel-level plane1 fl1)
   added: (at plane1 city0) (fuel-level plane1 fl0)
   goals met: 12 of 22
46. (refuel plane1 city0 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 12 of 22
47. (debark person22 plane1 city0)
   deleted: (in person22 plane1)
   added: (at person22 city0)
   goals met: 13 of 22
48. (debark person20 plane1 city0)
   deleted: (in person20 plane1)
   added: (at person20 city0)
   goals met: 14 of 22
49. (debark person1 plane1 city0)
   deleted: (in person1 plane1)
   added: (at person1 city0)
   goals met: 15 of 22
50. (fly plane1 city0 city3 fl1 fl0)
   deleted: (at plane1 city0) (fuel-level plane1 fl1)
   added: (at plane1 city3) (fuel-level plane1 fl0)
   goals met: 15 of 22
51. (refuel plane1 city3 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 15 of 22
52. (debark person3 plane1 city3)
   deleted: (in person3 plane1)
   added: (at person3 city3)
   goals met: 16 of 22
53. (debark person18 plane1 city3)
   deleted: (in person18 plane1)
   added: (at person18 city3)
   goals met: 17 of 22
54. (debark person17 plane1 city3)
   deleted: (in person17 plane1)
   added: (at person17 city3)
   goals met: 18 of 22
55. (fly plane1 city3 city5 fl1 fl0)
   deleted: (at plane1 city3) (fuel-level plane1 fl1)
   added: (at plane1 city5) (fuel-level plane1 fl0)
   goals met: 19 of 22
56. (refuel plane1 city5 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 19 of 22
57. (debark person12 plane1 city5)
   deleted: (in person12 plane1)
   added: (at person12 city5)
   goals met: 20 of 22
58. (fly plane1 city5 city2 fl1 fl0)
   deleted: (at plane1 city5) (fuel-level plane1 fl1)
   added: (at plane1 city2) (fuel-level plane1 fl0)
   goals met: 19 of 22
59. (refuel plane1 city2 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 19 of 22
60. (debark person7 plane1 city2)
   deleted: (in person7 plane1)
   added: (at person7 city2)
   goals met: 20 of 22
61. (fly plane1 city2 city6 fl1 fl0)
   deleted: (at plane1 city2) (fuel-level plane1 fl1)
   added: (at plane1 city6) (fuel-level plane1 fl0)
   goals met: 20 of 22
62. (refuel plane1 city6 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 20 of 22
63. (debark person21 plane1 city6)
   deleted: (in person21 plane1)
   added: (at person21 city6)
   goals met: 21 of 22
64. (fly plane1 city6 city5 fl1 fl0)
   deleted: (at plane1 city6) (fuel-level plane1 fl1)
   added: (at plane1 city5) (fuel-level plane1 fl0)
   goals met: 22 of 22
